grevaillot/svd_tools/headers/ATSAML11D15A/tc0.h
#pragma once 

/* --- TC0: Basic Timer Counter ------------------------------------- */

/** @defgroup tc0_registers Basic Timer Counter Register
@{*/

/** TC0_COUNT8_CTRLA Control A **/
#define TC0_COUNT8_CTRLA			MMIO32(TC0_BASE + 0x00)
/** TC0_COUNT16_CTRLA Control A **/
#define TC0_COUNT16_CTRLA			MMIO32(TC0_BASE + 0x00)
/** TC0_COUNT32_CTRLA Control A **/
#define TC0_COUNT32_CTRLA			MMIO32(TC0_BASE + 0x00)
/** TC0_COUNT8_CTRLBCLR Control B Clear **/
#define TC0_COUNT8_CTRLBCLR			MMIO32(TC0_BASE + 0x04)
/** TC0_COUNT16_CTRLBCLR Control B Clear **/
#define TC0_COUNT16_CTRLBCLR			MMIO32(TC0_BASE + 0x04)
/** TC0_COUNT32_CTRLBCLR Control B Clear **/
#define TC0_COUNT32_CTRLBCLR			MMIO32(TC0_BASE + 0x04)
/** TC0_COUNT8_CTRLBSET Control B Set **/
#define TC0_COUNT8_CTRLBSET			MMIO32(TC0_BASE + 0x05)
/** TC0_COUNT16_CTRLBSET Control B Set **/
#define TC0_COUNT16_CTRLBSET			MMIO32(TC0_BASE + 0x05)
/** TC0_COUNT32_CTRLBSET Control B Set **/
#define TC0_COUNT32_CTRLBSET			MMIO32(TC0_BASE + 0x05)
/** TC0_COUNT8_EVCTRL Event Control **/
#define TC0_COUNT8_EVCTRL			MMIO32(TC0_BASE + 0x06)
/** TC0_COUNT16_EVCTRL Event Control **/
#define TC0_COUNT16_EVCTRL			MMIO32(TC0_BASE + 0x06)
/** TC0_COUNT32_EVCTRL Event Control **/
#define TC0_COUNT32_EVCTRL			MMIO32(TC0_BASE + 0x06)
/** TC0_COUNT8_INTENCLR Interrupt Enable Clear **/
#define TC0_COUNT8_INTENCLR			MMIO32(TC0_BASE + 0x08)
/** TC0_COUNT16_INTENCLR Interrupt Enable Clear **/
#define TC0_COUNT16_INTENCLR			MMIO32(TC0_BASE + 0x08)
/** TC0_COUNT32_INTENCLR Interrupt Enable Clear **/
#define TC0_COUNT32_INTENCLR			MMIO32(TC0_BASE + 0x08)
/** TC0_COUNT8_INTENSET Interrupt Enable Set **/
#define TC0_COUNT8_INTENSET			MMIO32(TC0_BASE + 0x09)
/** TC0_COUNT16_INTENSET Interrupt Enable Set **/
#define TC0_COUNT16_INTENSET			MMIO32(TC0_BASE + 0x09)
/** TC0_COUNT32_INTENSET Interrupt Enable Set **/
#define TC0_COUNT32_INTENSET			MMIO32(TC0_BASE + 0x09)
/** TC0_COUNT8_INTFLAG Interrupt Flag Status and Clear **/
#define TC0_COUNT8_INTFLAG			MMIO32(TC0_BASE + 0x0a)
/** TC0_COUNT16_INTFLAG Interrupt Flag Status and Clear **/
#define TC0_COUNT16_INTFLAG			MMIO32(TC0_BASE + 0x0a)
/** TC0_COUNT32_INTFLAG Interrupt Flag Status and Clear **/
#define TC0_COUNT32_INTFLAG			MMIO32(TC0_BASE + 0x0a)
/** TC0_COUNT8_STATUS Status **/
#define TC0_COUNT8_STATUS			MMIO32(TC0_BASE + 0x0b)
/** TC0_COUNT16_STATUS Status **/
#define TC0_COUNT16_STATUS			MMIO32(TC0_BASE + 0x0b)
/** TC0_COUNT32_STATUS Status **/
#define TC0_COUNT32_STATUS			MMIO32(TC0_BASE + 0x0b)
/** TC0_COUNT8_WAVE Waveform Generation Control **/
#define TC0_COUNT8_WAVE			MMIO32(TC0_BASE + 0x0c)
/** TC0_COUNT16_WAVE Waveform Generation Control **/
#define TC0_COUNT16_WAVE			MMIO32(TC0_BASE + 0x0c)
/** TC0_COUNT32_WAVE Waveform Generation Control **/
#define TC0_COUNT32_WAVE			MMIO32(TC0_BASE + 0x0c)
/** TC0_COUNT8_DRVCTRL Control C **/
#define TC0_COUNT8_DRVCTRL			MMIO32(TC0_BASE + 0x0d)
/** TC0_COUNT16_DRVCTRL Control C **/
#define TC0_COUNT16_DRVCTRL			MMIO32(TC0_BASE + 0x0d)
/** TC0_COUNT32_DRVCTRL Control C **/
#define TC0_COUNT32_DRVCTRL			MMIO32(TC0_BASE + 0x0d)
/** TC0_COUNT8_DBGCTRL Debug Control **/
#define TC0_COUNT8_DBGCTRL			MMIO32(TC0_BASE + 0x0f)
/** TC0_COUNT16_DBGCTRL Debug Control **/
#define TC0_COUNT16_DBGCTRL			MMIO32(TC0_BASE + 0x0f)
/** TC0_COUNT32_DBGCTRL Debug Control **/
#define TC0_COUNT32_DBGCTRL			MMIO32(TC0_BASE + 0x0f)
/** TC0_COUNT8_SYNCBUSY Synchronization Status **/
#define TC0_COUNT8_SYNCBUSY			MMIO32(TC0_BASE + 0x10)
/** TC0_COUNT16_SYNCBUSY Synchronization Status **/
#define TC0_COUNT16_SYNCBUSY			MMIO32(TC0_BASE + 0x10)
/** TC0_COUNT32_SYNCBUSY Synchronization Status **/
#define TC0_COUNT32_SYNCBUSY			MMIO32(TC0_BASE + 0x10)
/** TC0_COUNT8_COUNT COUNT8 Count **/
#define TC0_COUNT8_COUNT			MMIO32(TC0_BASE + 0x14)
/** TC0_COUNT16_COUNT COUNT16 Count **/
#define TC0_COUNT16_COUNT			MMIO32(TC0_BASE + 0x14)
/** TC0_COUNT32_COUNT COUNT32 Count **/
#define TC0_COUNT32_COUNT			MMIO32(TC0_BASE + 0x14)
/** TC0_COUNT32_PER COUNT32 Period **/
#define TC0_COUNT32_PER			MMIO32(TC0_BASE + 0x18)
/** TC0_COUNT16_PER COUNT16 Period **/
#define TC0_COUNT16_PER			MMIO32(TC0_BASE + 0x1a)
/** TC0_COUNT8_PER COUNT8 Period **/
#define TC0_COUNT8_PER			MMIO32(TC0_BASE + 0x1b)
/** TC0_COUNT8_CC[%s] COUNT8 Compare and Capture **/
#define TC0_COUNT8_CC[%s]			MMIO32(TC0_BASE + 0x1c)
/** TC0_COUNT16_CC[%s] COUNT16 Compare and Capture **/
#define TC0_COUNT16_CC[%s]			MMIO32(TC0_BASE + 0x1c)
/** TC0_COUNT32_CC[%s] COUNT32 Compare and Capture **/
#define TC0_COUNT32_CC[%s]			MMIO32(TC0_BASE + 0x1c)
/** TC0_COUNT32_PERBUF COUNT32 Period Buffer **/
#define TC0_COUNT32_PERBUF			MMIO32(TC0_BASE + 0x2c)
/** TC0_COUNT16_PERBUF COUNT16 Period Buffer **/
#define TC0_COUNT16_PERBUF			MMIO32(TC0_BASE + 0x2e)
/** TC0_COUNT8_PERBUF COUNT8 Period Buffer **/
#define TC0_COUNT8_PERBUF			MMIO32(TC0_BASE + 0x2f)
/** TC0_COUNT8_CCBUF[%s] COUNT8 Compare and Capture Buffer **/
#define TC0_COUNT8_CCBUF[%s]			MMIO32(TC0_BASE + 0x30)
/** TC0_COUNT16_CCBUF[%s] COUNT16 Compare and Capture Buffer **/
#define TC0_COUNT16_CCBUF[%s]			MMIO32(TC0_BASE + 0x30)
/** TC0_COUNT32_CCBUF[%s] COUNT32 Compare and Capture Buffer **/
#define TC0_COUNT32_CCBUF[%s]			MMIO32(TC0_BASE + 0x30)

/**@}*/


/** @defgroup tc0_count8_ctrla COUNT8CTRLA Control A
@{*/


#define TC0_COUNT8_CTRLA_CAPTMODE1_SHIFT		27
#define TC0_COUNT8_CTRLA_CAPTMODE1_MASK		0x03
/** @defgroup tc0_count8_ctrla_captmode1 CAPTMODE1 Capture mode Channel 1
@{*/
/**@}*/


#define TC0_COUNT8_CTRLA_CAPTMODE0_SHIFT		24
#define TC0_COUNT8_CTRLA_CAPTMODE0_MASK		0x03
/** @defgroup tc0_count8_ctrla_captmode0 CAPTMODE0 Capture Mode Channel 0
@{*/
/**@}*/

/** TC0_COUNT8_CTRLA_COPEN1 Capture On Pin 1 Enable **/
#define TC0_COUNT8_CTRLA_COPEN1		(1 << 21)
/** TC0_COUNT8_CTRLA_COPEN0 Capture On Pin 0 Enable **/
#define TC0_COUNT8_CTRLA_COPEN0		(1 << 20)
/** TC0_COUNT8_CTRLA_CAPTEN1 Capture Channel 1 Enable **/
#define TC0_COUNT8_CTRLA_CAPTEN1		(1 << 17)
/** TC0_COUNT8_CTRLA_CAPTEN0 Capture Channel 0 Enable **/
#define TC0_COUNT8_CTRLA_CAPTEN0		(1 << 16)
/** TC0_COUNT8_CTRLA_ALOCK Auto Lock **/
#define TC0_COUNT8_CTRLA_ALOCK		(1 << 11)

#define TC0_COUNT8_CTRLA_PRESCALER_SHIFT		8
#define TC0_COUNT8_CTRLA_PRESCALER_MASK		0x07
/** @defgroup tc0_count8_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/

/** TC0_COUNT8_CTRLA_ONDEMAND Clock On Demand **/
#define TC0_COUNT8_CTRLA_ONDEMAND		(1 << 7)
/** TC0_COUNT8_CTRLA_RUNSTDBY Run during Standby **/
#define TC0_COUNT8_CTRLA_RUNSTDBY		(1 << 6)

#define TC0_COUNT8_CTRLA_PRESCSYNC_SHIFT		4
#define TC0_COUNT8_CTRLA_PRESCSYNC_MASK		0x03
/** @defgroup tc0_count8_ctrla_prescsync PRESCSYNC Prescaler and Counter Synchronization
@{*/
/**@}*/


#define TC0_COUNT8_CTRLA_MODE_SHIFT		2
#define TC0_COUNT8_CTRLA_MODE_MASK		0x03
/** @defgroup tc0_count8_ctrla_mode MODE Timer Counter Mode
@{*/
/**@}*/

/** TC0_COUNT8_CTRLA_ENABLE Enable **/
#define TC0_COUNT8_CTRLA_ENABLE		(1 << 1)
/** TC0_COUNT8_CTRLA_SWRST Software Reset **/
#define TC0_COUNT8_CTRLA_SWRST		(1 << 0)

/**@}*/

