grevaillot/svd_tools/headers/ATSAML11D15A/tc0.h
/** @defgroup tc0_count32_ctrlbset COUNT32CTRLBSET Control B Set
@{*/


#define TC0_COUNT32_CTRLBSET_CMD_SHIFT		5
#define TC0_COUNT32_CTRLBSET_CMD_MASK		0x07
/** @defgroup tc0_count32_ctrlbset_cmd CMD Command
@{*/
/**@}*/

/** TC0_COUNT32_CTRLBSET_ONESHOT One-Shot on Counter **/
#define TC0_COUNT32_CTRLBSET_ONESHOT		(1 << 2)
/** TC0_COUNT32_CTRLBSET_LUPD Lock Update **/
#define TC0_COUNT32_CTRLBSET_LUPD		(1 << 1)
/** TC0_COUNT32_CTRLBSET_DIR Counter Direction **/
#define TC0_COUNT32_CTRLBSET_DIR		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_evctrl COUNT8EVCTRL Event Control
@{*/

/** TC0_COUNT8_EVCTRL_MCEO1 MC Event Output Enable 1 **/
#define TC0_COUNT8_EVCTRL_MCEO1		(1 << 13)
/** TC0_COUNT8_EVCTRL_MCEO0 MC Event Output Enable 0 **/
#define TC0_COUNT8_EVCTRL_MCEO0		(1 << 12)
/** TC0_COUNT8_EVCTRL_OVFEO Event Output Enable **/
#define TC0_COUNT8_EVCTRL_OVFEO		(1 << 8)
/** TC0_COUNT8_EVCTRL_TCEI TC Event Enable **/
#define TC0_COUNT8_EVCTRL_TCEI		(1 << 5)
/** TC0_COUNT8_EVCTRL_TCINV TC Event Input Polarity **/
#define TC0_COUNT8_EVCTRL_TCINV		(1 << 4)

#define TC0_COUNT8_EVCTRL_EVACT_SHIFT		0
#define TC0_COUNT8_EVCTRL_EVACT_MASK		0x07
/** @defgroup tc0_count8_evctrl_evact EVACT Event Action
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count16_evctrl COUNT16EVCTRL Event Control
@{*/

/** TC0_COUNT16_EVCTRL_MCEO1 MC Event Output Enable 1 **/
#define TC0_COUNT16_EVCTRL_MCEO1		(1 << 13)
/** TC0_COUNT16_EVCTRL_MCEO0 MC Event Output Enable 0 **/
#define TC0_COUNT16_EVCTRL_MCEO0		(1 << 12)
/** TC0_COUNT16_EVCTRL_OVFEO Event Output Enable **/
#define TC0_COUNT16_EVCTRL_OVFEO		(1 << 8)
/** TC0_COUNT16_EVCTRL_TCEI TC Event Enable **/
#define TC0_COUNT16_EVCTRL_TCEI		(1 << 5)
/** TC0_COUNT16_EVCTRL_TCINV TC Event Input Polarity **/
#define TC0_COUNT16_EVCTRL_TCINV		(1 << 4)

#define TC0_COUNT16_EVCTRL_EVACT_SHIFT		0
#define TC0_COUNT16_EVCTRL_EVACT_MASK		0x07
/** @defgroup tc0_count16_evctrl_evact EVACT Event Action
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count32_evctrl COUNT32EVCTRL Event Control
@{*/

/** TC0_COUNT32_EVCTRL_MCEO1 MC Event Output Enable 1 **/
#define TC0_COUNT32_EVCTRL_MCEO1		(1 << 13)
/** TC0_COUNT32_EVCTRL_MCEO0 MC Event Output Enable 0 **/
#define TC0_COUNT32_EVCTRL_MCEO0		(1 << 12)
/** TC0_COUNT32_EVCTRL_OVFEO Event Output Enable **/
#define TC0_COUNT32_EVCTRL_OVFEO		(1 << 8)
/** TC0_COUNT32_EVCTRL_TCEI TC Event Enable **/
#define TC0_COUNT32_EVCTRL_TCEI		(1 << 5)
/** TC0_COUNT32_EVCTRL_TCINV TC Event Input Polarity **/
#define TC0_COUNT32_EVCTRL_TCINV		(1 << 4)

#define TC0_COUNT32_EVCTRL_EVACT_SHIFT		0
#define TC0_COUNT32_EVCTRL_EVACT_MASK		0x07
/** @defgroup tc0_count32_evctrl_evact EVACT Event Action
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count8_intenclr COUNT8INTENCLR Interrupt Enable Clear
@{*/

/** TC0_COUNT8_INTENCLR_MC1 MC Interrupt Disable 1 **/
#define TC0_COUNT8_INTENCLR_MC1		(1 << 5)
/** TC0_COUNT8_INTENCLR_MC0 MC Interrupt Disable 0 **/
#define TC0_COUNT8_INTENCLR_MC0		(1 << 4)
/** TC0_COUNT8_INTENCLR_ERR ERR Interrupt Disable **/
#define TC0_COUNT8_INTENCLR_ERR		(1 << 1)
/** TC0_COUNT8_INTENCLR_OVF OVF Interrupt Disable **/
#define TC0_COUNT8_INTENCLR_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_intenclr COUNT16INTENCLR Interrupt Enable Clear
@{*/

/** TC0_COUNT16_INTENCLR_MC1 MC Interrupt Disable 1 **/
#define TC0_COUNT16_INTENCLR_MC1		(1 << 5)
/** TC0_COUNT16_INTENCLR_MC0 MC Interrupt Disable 0 **/
#define TC0_COUNT16_INTENCLR_MC0		(1 << 4)
/** TC0_COUNT16_INTENCLR_ERR ERR Interrupt Disable **/
#define TC0_COUNT16_INTENCLR_ERR		(1 << 1)
/** TC0_COUNT16_INTENCLR_OVF OVF Interrupt Disable **/
#define TC0_COUNT16_INTENCLR_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_intenclr COUNT32INTENCLR Interrupt Enable Clear
@{*/

/** TC0_COUNT32_INTENCLR_MC1 MC Interrupt Disable 1 **/
#define TC0_COUNT32_INTENCLR_MC1		(1 << 5)
/** TC0_COUNT32_INTENCLR_MC0 MC Interrupt Disable 0 **/
#define TC0_COUNT32_INTENCLR_MC0		(1 << 4)
/** TC0_COUNT32_INTENCLR_ERR ERR Interrupt Disable **/
#define TC0_COUNT32_INTENCLR_ERR		(1 << 1)
/** TC0_COUNT32_INTENCLR_OVF OVF Interrupt Disable **/
#define TC0_COUNT32_INTENCLR_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_intenset COUNT8INTENSET Interrupt Enable Set
@{*/

/** TC0_COUNT8_INTENSET_MC1 MC Interrupt Enable 1 **/
#define TC0_COUNT8_INTENSET_MC1		(1 << 5)
/** TC0_COUNT8_INTENSET_MC0 MC Interrupt Enable 0 **/
#define TC0_COUNT8_INTENSET_MC0		(1 << 4)
/** TC0_COUNT8_INTENSET_ERR ERR Interrupt Enable **/
#define TC0_COUNT8_INTENSET_ERR		(1 << 1)
/** TC0_COUNT8_INTENSET_OVF OVF Interrupt Enable **/
#define TC0_COUNT8_INTENSET_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_intenset COUNT16INTENSET Interrupt Enable Set
@{*/

/** TC0_COUNT16_INTENSET_MC1 MC Interrupt Enable 1 **/
#define TC0_COUNT16_INTENSET_MC1		(1 << 5)
/** TC0_COUNT16_INTENSET_MC0 MC Interrupt Enable 0 **/
#define TC0_COUNT16_INTENSET_MC0		(1 << 4)
/** TC0_COUNT16_INTENSET_ERR ERR Interrupt Enable **/
#define TC0_COUNT16_INTENSET_ERR		(1 << 1)
/** TC0_COUNT16_INTENSET_OVF OVF Interrupt Enable **/
#define TC0_COUNT16_INTENSET_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_intenset COUNT32INTENSET Interrupt Enable Set
@{*/

/** TC0_COUNT32_INTENSET_MC1 MC Interrupt Enable 1 **/
#define TC0_COUNT32_INTENSET_MC1		(1 << 5)
/** TC0_COUNT32_INTENSET_MC0 MC Interrupt Enable 0 **/
#define TC0_COUNT32_INTENSET_MC0		(1 << 4)
/** TC0_COUNT32_INTENSET_ERR ERR Interrupt Enable **/
#define TC0_COUNT32_INTENSET_ERR		(1 << 1)
/** TC0_COUNT32_INTENSET_OVF OVF Interrupt Enable **/
#define TC0_COUNT32_INTENSET_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_intflag COUNT8INTFLAG Interrupt Flag Status and Clear
@{*/

/** TC0_COUNT8_INTFLAG_MC1 MC Interrupt Flag 1 **/
#define TC0_COUNT8_INTFLAG_MC1		(1 << 5)
/** TC0_COUNT8_INTFLAG_MC0 MC Interrupt Flag 0 **/
#define TC0_COUNT8_INTFLAG_MC0		(1 << 4)
/** TC0_COUNT8_INTFLAG_ERR ERR Interrupt Flag **/
#define TC0_COUNT8_INTFLAG_ERR		(1 << 1)
/** TC0_COUNT8_INTFLAG_OVF OVF Interrupt Flag **/
#define TC0_COUNT8_INTFLAG_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_intflag COUNT16INTFLAG Interrupt Flag Status and Clear
@{*/

