grevaillot/svd_tools/headers/ATSAML11D15A/tc0.h
/** TC0_COUNT16_INTFLAG_MC1 MC Interrupt Flag 1 **/
#define TC0_COUNT16_INTFLAG_MC1		(1 << 5)
/** TC0_COUNT16_INTFLAG_MC0 MC Interrupt Flag 0 **/
#define TC0_COUNT16_INTFLAG_MC0		(1 << 4)
/** TC0_COUNT16_INTFLAG_ERR ERR Interrupt Flag **/
#define TC0_COUNT16_INTFLAG_ERR		(1 << 1)
/** TC0_COUNT16_INTFLAG_OVF OVF Interrupt Flag **/
#define TC0_COUNT16_INTFLAG_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_intflag COUNT32INTFLAG Interrupt Flag Status and Clear
@{*/

/** TC0_COUNT32_INTFLAG_MC1 MC Interrupt Flag 1 **/
#define TC0_COUNT32_INTFLAG_MC1		(1 << 5)
/** TC0_COUNT32_INTFLAG_MC0 MC Interrupt Flag 0 **/
#define TC0_COUNT32_INTFLAG_MC0		(1 << 4)
/** TC0_COUNT32_INTFLAG_ERR ERR Interrupt Flag **/
#define TC0_COUNT32_INTFLAG_ERR		(1 << 1)
/** TC0_COUNT32_INTFLAG_OVF OVF Interrupt Flag **/
#define TC0_COUNT32_INTFLAG_OVF		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_status COUNT8STATUS Status
@{*/

/** TC0_COUNT8_STATUS_CCBUFV1 Compare channel buffer 1 valid **/
#define TC0_COUNT8_STATUS_CCBUFV1		(1 << 5)
/** TC0_COUNT8_STATUS_CCBUFV0 Compare channel buffer 0 valid **/
#define TC0_COUNT8_STATUS_CCBUFV0		(1 << 4)
/** TC0_COUNT8_STATUS_PERBUFV Synchronization Busy Status **/
#define TC0_COUNT8_STATUS_PERBUFV		(1 << 3)
/** TC0_COUNT8_STATUS_SLAVE Slave Status Flag **/
#define TC0_COUNT8_STATUS_SLAVE		(1 << 1)
/** TC0_COUNT8_STATUS_STOP Stop Status Flag **/
#define TC0_COUNT8_STATUS_STOP		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_status COUNT16STATUS Status
@{*/

/** TC0_COUNT16_STATUS_CCBUFV1 Compare channel buffer 1 valid **/
#define TC0_COUNT16_STATUS_CCBUFV1		(1 << 5)
/** TC0_COUNT16_STATUS_CCBUFV0 Compare channel buffer 0 valid **/
#define TC0_COUNT16_STATUS_CCBUFV0		(1 << 4)
/** TC0_COUNT16_STATUS_PERBUFV Synchronization Busy Status **/
#define TC0_COUNT16_STATUS_PERBUFV		(1 << 3)
/** TC0_COUNT16_STATUS_SLAVE Slave Status Flag **/
#define TC0_COUNT16_STATUS_SLAVE		(1 << 1)
/** TC0_COUNT16_STATUS_STOP Stop Status Flag **/
#define TC0_COUNT16_STATUS_STOP		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_status COUNT32STATUS Status
@{*/

/** TC0_COUNT32_STATUS_CCBUFV1 Compare channel buffer 1 valid **/
#define TC0_COUNT32_STATUS_CCBUFV1		(1 << 5)
/** TC0_COUNT32_STATUS_CCBUFV0 Compare channel buffer 0 valid **/
#define TC0_COUNT32_STATUS_CCBUFV0		(1 << 4)
/** TC0_COUNT32_STATUS_PERBUFV Synchronization Busy Status **/
#define TC0_COUNT32_STATUS_PERBUFV		(1 << 3)
/** TC0_COUNT32_STATUS_SLAVE Slave Status Flag **/
#define TC0_COUNT32_STATUS_SLAVE		(1 << 1)
/** TC0_COUNT32_STATUS_STOP Stop Status Flag **/
#define TC0_COUNT32_STATUS_STOP		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_wave COUNT8WAVE Waveform Generation Control
@{*/


#define TC0_COUNT8_WAVE_WAVEGEN_SHIFT		0
#define TC0_COUNT8_WAVE_WAVEGEN_MASK		0x03
/** @defgroup tc0_count8_wave_wavegen WAVEGEN Waveform Generation Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count16_wave COUNT16WAVE Waveform Generation Control
@{*/


#define TC0_COUNT16_WAVE_WAVEGEN_SHIFT		0
#define TC0_COUNT16_WAVE_WAVEGEN_MASK		0x03
/** @defgroup tc0_count16_wave_wavegen WAVEGEN Waveform Generation Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count32_wave COUNT32WAVE Waveform Generation Control
@{*/


#define TC0_COUNT32_WAVE_WAVEGEN_SHIFT		0
#define TC0_COUNT32_WAVE_WAVEGEN_MASK		0x03
/** @defgroup tc0_count32_wave_wavegen WAVEGEN Waveform Generation Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count8_drvctrl COUNT8DRVCTRL Control C
@{*/

/** TC0_COUNT8_DRVCTRL_INVEN1 Output Waveform Invert Enable 1 **/
#define TC0_COUNT8_DRVCTRL_INVEN1		(1 << 1)
/** TC0_COUNT8_DRVCTRL_INVEN0 Output Waveform Invert Enable 0 **/
#define TC0_COUNT8_DRVCTRL_INVEN0		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_drvctrl COUNT16DRVCTRL Control C
@{*/

/** TC0_COUNT16_DRVCTRL_INVEN1 Output Waveform Invert Enable 1 **/
#define TC0_COUNT16_DRVCTRL_INVEN1		(1 << 1)
/** TC0_COUNT16_DRVCTRL_INVEN0 Output Waveform Invert Enable 0 **/
#define TC0_COUNT16_DRVCTRL_INVEN0		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_drvctrl COUNT32DRVCTRL Control C
@{*/

/** TC0_COUNT32_DRVCTRL_INVEN1 Output Waveform Invert Enable 1 **/
#define TC0_COUNT32_DRVCTRL_INVEN1		(1 << 1)
/** TC0_COUNT32_DRVCTRL_INVEN0 Output Waveform Invert Enable 0 **/
#define TC0_COUNT32_DRVCTRL_INVEN0		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_dbgctrl COUNT8DBGCTRL Debug Control
@{*/

/** TC0_COUNT8_DBGCTRL_DBGRUN Run During Debug **/
#define TC0_COUNT8_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_dbgctrl COUNT16DBGCTRL Debug Control
@{*/

/** TC0_COUNT16_DBGCTRL_DBGRUN Run During Debug **/
#define TC0_COUNT16_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_dbgctrl COUNT32DBGCTRL Debug Control
@{*/

/** TC0_COUNT32_DBGCTRL_DBGRUN Run During Debug **/
#define TC0_COUNT32_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_syncbusy COUNT8SYNCBUSY Synchronization Status
@{*/

/** TC0_COUNT8_SYNCBUSY_CC1 Compare Channel 1 **/
#define TC0_COUNT8_SYNCBUSY_CC1		(1 << 7)
/** TC0_COUNT8_SYNCBUSY_CC0 Compare Channel 0 **/
#define TC0_COUNT8_SYNCBUSY_CC0		(1 << 6)
/** TC0_COUNT8_SYNCBUSY_PER Period **/
#define TC0_COUNT8_SYNCBUSY_PER		(1 << 5)
/** TC0_COUNT8_SYNCBUSY_COUNT Counter **/
#define TC0_COUNT8_SYNCBUSY_COUNT		(1 << 4)
/** TC0_COUNT8_SYNCBUSY_STATUS STATUS **/
#define TC0_COUNT8_SYNCBUSY_STATUS		(1 << 3)
/** TC0_COUNT8_SYNCBUSY_CTRLB CTRLB **/
#define TC0_COUNT8_SYNCBUSY_CTRLB		(1 << 2)
/** TC0_COUNT8_SYNCBUSY_ENABLE enable **/
#define TC0_COUNT8_SYNCBUSY_ENABLE		(1 << 1)
/** TC0_COUNT8_SYNCBUSY_SWRST swrst **/
#define TC0_COUNT8_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_syncbusy COUNT16SYNCBUSY Synchronization Status
@{*/

/** TC0_COUNT16_SYNCBUSY_CC1 Compare Channel 1 **/
#define TC0_COUNT16_SYNCBUSY_CC1		(1 << 7)
/** TC0_COUNT16_SYNCBUSY_CC0 Compare Channel 0 **/
#define TC0_COUNT16_SYNCBUSY_CC0		(1 << 6)
/** TC0_COUNT16_SYNCBUSY_PER Period **/
#define TC0_COUNT16_SYNCBUSY_PER		(1 << 5)
/** TC0_COUNT16_SYNCBUSY_COUNT Counter **/
#define TC0_COUNT16_SYNCBUSY_COUNT		(1 << 4)
/** TC0_COUNT16_SYNCBUSY_STATUS STATUS **/
#define TC0_COUNT16_SYNCBUSY_STATUS		(1 << 3)
/** TC0_COUNT16_SYNCBUSY_CTRLB CTRLB **/
#define TC0_COUNT16_SYNCBUSY_CTRLB		(1 << 2)
/** TC0_COUNT16_SYNCBUSY_ENABLE enable **/
#define TC0_COUNT16_SYNCBUSY_ENABLE		(1 << 1)
/** TC0_COUNT16_SYNCBUSY_SWRST swrst **/
#define TC0_COUNT16_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_syncbusy COUNT32SYNCBUSY Synchronization Status
@{*/

